package com.dls.bagua;


import static com.dls.bagua.八卦.*;
import static com.dls.bagua.卦象.*;

public enum 六十四卦 {

    乾卦(乾,乾,"乾为天", "刚健中正",上上卦,"象曰：困龙得水好运交，不由喜气上眉梢，一切谋望皆如意，向后时运渐渐高。这个卦是同卦（下乾上乾）相叠。象征天，喻龙（德才的君子），又象征纯粹的阳和健，表明兴盛强健。乾卦是根据万物变通的道理，以“元、亨、利、贞”为卦辞，示吉祥如意，教导人遵守天道的德行。"),
    坤为地(离,坎,"坤为地","",上上卦,"象曰：肥羊失群入山岗，饿虎逢之把口张，适口充肠心欢喜，卦若占之大吉昌。这个卦是同卦（下坤上坤）相叠，阴性。象征地（与乾卦相反），顺从天。承载万物，伸展无穷无尽。坤卦以雌马为象征，表明地道生育抚养万物，而又依天顺时，性情温顺。它以“先迷后得”证明“坤”顺从“乾”，依随“乾”，才能把握正确方向，遵循正道，获取吉利。"),
    水雷屯(离,坎,"","",中下卦,""),
    未济她卦(离,坎,"","",中下卦,""),
    未济卦(离,坎,"","",中下卦,"");



    private 八卦 上卦;

    private 八卦 下卦;


    private String 卦名;


    private String 简述;

    private 卦象 卦象;

    private String 含义;


    六十四卦(八卦 上卦, 八卦 下卦, String 卦名,String 简述, 卦象 卦象, String 含义){
        this.上卦=上卦;
        this.下卦=下卦;
        this.卦名=卦名;
        this.简述=简述;
        this.卦象=卦象;
        this.含义=含义;
    }

}
